In [2]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
import pandas as pd

In [9]:
l1 = [4, 8, 15, 16, 23, 42]
print("The type of l1 is  ", type(l1))
df1 = pd.Series(l1)
print("Series is\n", df1)
print("The type of df1 is  ", type(df1))

The type of l1 is   <class 'list'>
Series is
 0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64
The type of df1 is   <class 'pandas.core.series.Series'>

In [10]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

In [12]:
l1 = [0,1,2,3,4,5,6,7,8,9]
df1 = pd.Series(l1)
print("Series is\n", df1)
print("The type of df1 is  ", type(df1))

Series is
 0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
The type of df1 is   <class 'pandas.core.series.Series'>

In [13]:
# Create a Pandas DataFrame that contains the following data:

In [9]:
df1 = pd.read_excel("Book1.xlsx")
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [1]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [2]:

# Data Frame:-  It is a structured and in the form of rows and columns.
# Series:- It is similar to list. It is a sub class of Data Frame

In [3]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [4]:
# Common functions to maupulate data are 
# 1) head()
# 2) tail()
# 3) Series()

In [10]:
# ex 
df1.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [11]:
df1.tail(1)

     Name  Age  Gender
2  Claire   27  Female

In [12]:
df1['Age']

0    25
1    30
2    27
Name: Age, dtype: int64

In [13]:
df1[['Age', 'Gender']]

   Age  Gender
0   25  Female
1   30    Male
2   27  Female

In [14]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [15]:
# All of the them are value mutable (can be changed) and except Series all are size mutable. Series is size immutable

In [16]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [24]:
# Importing Pandas library
import pandas as pd

# Creating two lists
author = ['Jitender', 'Purnima',
		'Arpit', 'Jyoti']
article = [210, 211, 114, 178]

# Convrting the lists into series
auth_series = pd.Series(author)
article_series = pd.Series(article)

# # Creating a dictionary by passing Series objects as values
frame = {'Author': auth_series,
		'Article': article_series}

# # Creating DataFrame by passing Dictionary
result = pd.DataFrame(frame)

# # Printing elements of Dataframe
print(result)
type(result)

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

pandas.core.frame.DataFrame